{
  "2.0.0": {
    "en": "Initial release of recoded and upgraded app based on the work by Glenn S. Pedersen. App also supports SDK 3, which means that Homey Pro 2023 users can use the app"
  },
  "2.0.1": {
    "en": "Changed formatting in readme files"
  },
  "2.0.2": {
    "en": "Fixed authentication"
  },
  "2.0.3": {
    "en": "Fixed re-authentication errors"
  },
  "2.0.4": {
    "en": "Changed the method of authentication. Apparently refreshing tokens after 5 minutes results in 401 error (Not authorized). The app now logs you in every 5 minutes"
  },
  "2.0.5": {
    "en": "Added contribution/donation links"
  },
  "2.1.0": {
    "en": "Permanently fixed the re-authentication error. The app won't sign in every 5 minutes anymore, rather it will refresh the access tokens periodically."
  },
  "2.1.1": {
    "en": "Disabled pulling data from API if device isn't heating"
  },
  "2.1.2": {
    "en": "Fixed the power meter not resetting to 0 when oven is turned off"
  },
  "2.1.3": {
    "en": "Increased the refresh interval of the power meter, as it seems the Mill API doesn't like too many requests."
  },
  "2.1.4": {
    "en": "Fixed an issue where the device wouldn't set the mode to Weekly program from flow."
  },
  "2.2.0": {
    "en": "Added support for Mill Sense"
  },
  "2.3.0": {
    "en": "Re-coded the whole authentication system. Now it shouldn't spam the Mill API with requests."
  },
  "2.3.1": {
    "en": "Removed unnecessary logging"
  },
  "2.3.2": {
    "en": "Added necessary logging"
  },
  "2.3.3": {
    "en": "Switched over to using the open_api instead of the mobile_api. This change should now prevent you from being completely logged out of the Mill mobile app."
  },
  "2.3.4": {
    "en": "Fixed the interval validation in the app settings. It now doesn't allow polling intervals under 60 seconds. This is for both Mill and Mill Sense products. Default is respectively 300 and 900."
  },
  "2.3.5": {
    "en": "Increased the update interval for the power meter"
  },
  "2.3.6": {
    "en": "Changed the Mill Sense driver image"
  },
  "2.3.7": {
    "en": "Updated community topic url"
  },
  "2.3.8": {
    "en": "Changed \"Mill Sense\" to \"Mill Sense Air\""
  },
  "2.3.9": {
    "en": "Added flow card \"When TVOC was changed\" for Mill sense devices."
  },
  "2.4.0": {
    "en": "Added a replacement driver for the Mill heaters, supporting both local and cloud api communication. Meaning you're not dependant on an active Internet connection to let Homey control your heaters. Try this new driver by adding your Mill heaters with the new Mill v2 driver. Please report any and all issues or errors you may encounter. The new driver will be a permanent replacement of the old v1 driver, when all bugs and errors are fixed."
  },
  "2.4.1": {
    "en": "Fixed an issue with pairing Mill heaters with the old driver after the API logic changed. Also forgot to mention that in release v2.4.0, support for Mill Silent Pro Compact was added."
  },
  "2.4.2": {
    "en": "Fixed an issue where the old Mill driver wouldn't work after the new Mill v2 driver was implemented. This should now be fully resolved. Both drivers now use the same new Mill API instance I created for the v2 driver."
  },
  "2.4.3": {
    "en": "The Mill v2 driver will now list all your devices, across all houses and shared houses"
  },
  "2.4.4": {
    "en": "Improved error handling. Also fixed a bug where the device would become unavailable because of a http 400 error."
  },
  "2.4.5": {
    "en": "Fixed an issue where local devices wouldn't refresh after it's become available again after connection loss."
  },
  "2.4.6": {
    "en": "Added support email, and homepage to metadata"
  },
  "2.4.7": {
    "en": "Updated app description and tagline"
  },
  "2.4.8": {
    "en": "Replaced the TVOC icon with a new one"
  },
  "2.4.9": {
    "en": "Added a check to prevent null/undefined errors"
  },
  "2.4.10": {
    "en": "Fixed the autoscan feature in the pairing process. Also fixed some bugs, causing you not to be able to add the heater IP address manually."
  },
  "2.4.11": {
    "en": "Enhanced thermostat mode options, introduced energy consumption settings."
  },
  "2.4.12": {
    "en": "Adding a missing capability."
  },
  "2.4.13": {
    "en": "Home page correction."
  },
  "2.4.14": {
    "en": "Home page correction."
  },
  "2.4.15": {
    "en": "New flow card conditions for Sense Air."
  },
  "2.4.16": {
    "en": "Adding support for power level adjustment for Oil Heaters."
  },
  "2.4.17": {
    "en": "Added support for Oil Gen3 maximum power control mode."
  },
  "2.4.18": {
    "en": "Minor fixes."
  },
  "2.4.19": {
    "en": "Minor fixes."
  },
  "2.4.20": {
    "en": "Bug fixes. "
  },
  "2.4.21": {
    "en": "Bug fixes."
  }
}
